In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
df = pd.read_csv("Titanic.csv")

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Pclass       891 non-null    int64
 2   Name         891 non-null    object
 3   Sex          891 non-null    object
 4   Age          714 non-null    float64
 5   SibSp        891 non-null    int64
 6   Parch        891 non-null    int64
 7   Ticket       891 non-null    object
 8   Fare         891 non-null    float64
 9   Cabin        204 non-null    object
 10  Embarked     889 non-null    object
 11  Survived     891 non-null    int64
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [4]:
df.describe()

,PassengerId,Pclass,Age,SibSp,Parch,Fare,Survived
count,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000,891.000000
mean,446.000000,2.308642,29.699118,0.523008,0.381594,32.204208,0.383838
std,257.353842,0.836071,14.526497,1.102743,0.806057,49.693429,0.486592
min,1.000000,1.000000,0.420000,0.000000,0.000000,0.000000,0.000000
25%,223.500000,2.000000,20.125000,0.000000,0.000000,7.910400,0.000000
50%,446.000000,3.000000,28.000000,0.000000,0.000000,14.454200,0.000000
75%,668.500000,3.000000,38.000000,1.000000,0.000000,31.000000,1.000000
max,891.000000,3.000000,80.000000,8.000000,6.000000,512.329200,1.000000

In [5]:
df.isnull().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
Survived         0
dtype: int64

In [6]:
df.isna().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
Survived         0
dtype: int64

In [7]:
pd.isna(df['Age']).sum()

177

In [8]:
df['Age'].isna().sum()

177

In [9]:
df.Age.isna().sum()

177

In [10]:
df.shape

(891, 12)

In [11]:
df.head(7)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1
4,5,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0
5,6,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q,0
6,7,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S,0

In [12]:
df.Name.apply(lambda x: x.split(',')[1].split('.')[0].strip()).unique()

array(['Mr', 'Mrs', 'Miss', 'Master', 'Don', 'Rev', 'Dr', 'Mme', 'Ms',
       'Major', 'Lady', 'Sir', 'Mlle', 'Col', 'Capt', 'the Countess',
       'Jonkheer'], dtype=object)

In [13]:
def f(name):
    if '.' in name:
        return name.split(',')[1].split('.')[0].strip()
    else:
        return 'Unknown'

In [14]:
def g(tt):
    if tt in ['Mr']:
        return 1
    elif tt in ['Master']:
        return 3
    elif tt in ['Ms', 'Mlle', 'Miss']:
        return 4
    elif tt in ['Mrs','Mme']:
        return 5
    else:
        return 2

In [ ]:
tt="qqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqq"
%timeit if tt in ['Mr']:    pass

In [ ]:
tt="qqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqq"
%timeit if tt =='Mr':    pass

In [ ]:
df['title'] = df['Name'].apply(f).apply(g)
df.head(5)

In [ ]:
df['title2'] = df['Name'].transform(lambda x: x.split(',')[1].split('.')[0].strip())

In [ ]:
df

In [ ]:
pd.crosstab(df['Sex'], df['title2'])

In [ ]:
t = pd.crosstab(df['title'], df['Survived'])
t

In [ ]:
tt2= pd.crosstab(df['Sex'], df['Survived'] )
tt2

In [ ]:
 (81 + 233)

In [ ]:
round(tt2.div(tt2.sum(1), axis=0) * 100, 2)

In [ ]:
tt2.sum(1)

In [ ]:
t_pct = t.div(t.sum(1).astype(float), axis=0)
t_pct * 100

In [ ]:
t_pct.plot(kind='bar',stacked=True, title='Survival Rate by title')

plt.xlabel('title')

plt.ylabel('Survival Rate')

In [ ]:
# drop unnecessary columns

In [ ]:
df = df.drop(['PassengerId','Name','Ticket'], axis=1)   
df.head()

In [ ]:
# Embarked
# get_dummies: Convert categorical variable into dummy/indicator variables
edt  = pd.get_dummies(df['Embarked'])
edt

In [ ]:
edt.sum(axis = 1).sum()

In [ ]:
df['Embarked'].isna().sum()

In [ ]:
#edt
edt.drop(['S'], axis=1, inplace=True)

In [ ]:
df = df.join(edt)
df

In [ ]:
df.drop(['Embarked'], axis=1,inplace=True)
df.head(3)

In [ ]:
#example groupby

In [ ]:
df2 = pd.DataFrame({'Bird' : ['A', 'A', 'B', 'B', 'B'],'Speed' : [380, 370, 24, 26,np.nan]})
df2

In [ ]:
df2.groupby(['Bird']).mean()

In [ ]:
df2['Speed'] = df2.groupby(['Bird'])['Speed'].transform(lambda x: x.fillna(x.mean()))
df2

In [ ]:
# Age impute
df

In [ ]:
df['Age'].isna().sum()

In [ ]:
df['Age'].notna().sum()

In [ ]:
df.info()

In [ ]:
df['Age'] = df.groupby(['Pclass'])['Age'].transform(lambda x: x.fillna(x.mean()))
df

In [ ]:
df['Cabin'].isna().sum()

In [ ]:
df['Cabin'].notna().sum()

In [ ]:
687 * 100 /(687 + 204)

In [ ]:
# Cabin
# It has a lot of NaN values, so it won't cause a remarkable impact on prediction
df.drop("Cabin",axis=1,inplace=True)
df

In [ ]:
##sexes
s = sorted(df['Sex'].unique())
s

In [ ]:
list(zip(s, range(len(s)) ))

In [ ]:
gm = dict(zip(s, range(len(s)) ))
gm

In [ ]:
df['Sex'].head(5)

In [ ]:
df['Sex'] = df['Sex'].map(gm).astype(int)
df['Sex'].head(5)

In [ ]:
list(zip('abcadefg', range(4), range(6)))